module.exports = {
    createStore() {
        // здесь должна быть реализация 
    },

    combineReducers() {
        // здесь должна быть реализация 
    }
}

class Redux {
    constructor() {
        // здесь должна быть реализация
    }
    getState() {
        // здесь должна быть реализация
    }

    dispatch() {
        // здесь должна быть реализация
    }

    subscribe() {
        // здесь должна быть реализация
    }

    unsubscribe() {
        // здесь должна быть реализация
    }
}
